//Даны 3 целых числа. Найти количество положительных чисел в исходном наборе

public class Homeworkfor {

    public static void main(String[] args) {

        int a = 3;
        int b = 6;
        int c = 32;

        if (a>0 & b>0 & c>0) {
            System.out.println("3 числа положительные");
        }
    }
}
