//В переменную записываем число. Надо вывести на экран сколько в этом числе цифр и положительное оно или отрицательное.
//        Например, "это однозначное положительное число".
//        Достаточно будет определить, является ли число однозначным, "двузначным или трехзначным и более.

public class Homeworkone {

    public static void main(String[] args) {

        int n = 32;

        if (n<100 & (n>0)) {
            System.out.println("Число n двузначное положительное число");
        }
    }
}
